AioCMS/src/Catalogs/Сообщества/Сообщества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сообщества</name>
  <predefined>
    <items>
      <name>Athenaeum</name>
      <description>Two- Digit Athenaeum</description>
    </items>
    <items>
      <name>Тест</name>
      <description>Тест</description>
    </items>
  </predefined>
  <attributes>
    <name>ВК_ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_V</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_group_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_owner_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_client_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_access_token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_client_secret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_communitysecret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_communitytoken</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_chat_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаVK</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>TGB_token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDАльбома</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПостовВДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_НомерКомпании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_Кабинет</name>
    <type>
      <types>CatalogRef.РекламныеКабинеты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВК_ДневнойЛимитНаЗапись</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_НомерКатегории</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбъявлений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйУровеньПоста</name>
    <type>
      <types>EnumRef.УровниПостов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСообществ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщества</name>
    <type>
      <types>EnumRef.ТипыСообществ</types>
    </type>
  </attributes>
  <attributes>
    <name>РаскруткаБотами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лого</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСложноПосты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСложнопостов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьСтатистику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВК_bot_secret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_bot_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_КаналАрхив</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Объявления</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОбновления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AioCMS/src/Catalogs/Сообщества/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КартинкаЛого = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Лого");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Авторизовать(Команда)
	АвторизоватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКомпанию(Команда)
	//@skip-check unknown-method-property
	Объект.ВК_НомерКомпании = СоздатьКомпаниюНаСервере(Объект.Ссылка);
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПутьОткрытие(Команда)
	
	ИнструментарийКлиент.ЗаписатьФайлВРеквизит(Объект.Ссылка, ЭтотОбъект, "Лого");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АвторизоватьНаСервере()
	
	СсылкаАвторизации = МетодыРаботыVK.СоздатьСсылкуПолученияТокена(Объект.ВК_client_id);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьКомпаниюНаСервере(Сообщество)
	
	РеквизитыСообщества = ИнструментарийВызовСервера.ЗначенияРеквизитовОбъекта(Сообщество, "ВК_Кабинет,Наименование");
	IDКабинета 			= РеквизитыСообщества.ВК_Кабинет.ID;
	Возврат МетодыРаботыVK.СоздатьРекламнуюКампанию(
		Сообщество
		, IDКабинета
		, "AIO-" + РеквизитыСообщества.Наименование)["response"][0]["id"];

КонецФункции

#КонецОбласти
